"""
Имя проекта: practicum_1
Номер версии: 1.0
Имя файла: 10.py
Автор: 2020 © Ю.А. Мазкова, Челябинск
Лицензия использования:  CC BY-NC 4.0 (https://creativecommons.org/licenses/by-nc/4.0/deed.ru)
Дата создания: 10/12/2020
Дата последней модификации: 10/12/2020
Связанные файлы/пакеты: numpy, random
Описание: Решение задач № 1-101 практикума № 1
Дано натуральное число. Определить, будет ли это число: чётным, кратным 10.
#версия Python: 3.9.0
"""
a = int(input("Введите число для проверки:"))
if a % 2 == 0 and a % 10 == 0:
    print("Число", a, "четно и кратно 10")
else:
    print("Число не соответствует условиям")
