"""
Имя проекта: practicum_1
Номер версии: 1.0
Имя файла: 15.py
Автор: 2020 © Ю.А. Мазкова, Челябинск
Лицензия использования:  CC BY-NC 4.0 (https://creativecommons.org/licenses/by-nc/4.0/deed.ru)
Дата создания: 10/12/2020
Дата последней модификации: 10/12/2020
Связанные файлы/пакеты: numpy, random
Описание: Решение задач № 1-101 практикума № 1
Дан номер места в плацкартном вагоне. Определить, какое это место: верхнее или нижнее, в купе или боковое.
#версия Python: 3.9.0
"""
num = int(input("Укажите номер места в плацкартном вагоне:"))
if (num > 100):
    print("Такого места не существует")
elif (num > 0 and num < 50):
    print("Место в купе")
else:
    print("Место - боковое")
if (num % 2 == 0):
    print("верхнее")
else:
    print("нижнее")
