"""
Имя проекта: practicum_1
Номер версии: 1.0
Имя файла: 16.py
Автор: 2020 © Ю.А. Мазкова, Челябинск
Лицензия использования:  CC BY-NC 4.0 (https://creativecommons.org/licenses/by-nc/4.0/deed.ru)
Дата создания: 10/12/2020
Дата последней модификации: 10/12/2020
Связанные файлы/пакеты: numpy, random
Описание: Решение задач № 1-101 практикума № 1
Известна денежная сумма. Разменять её купюрами 500, 100, 10 и монетой 2 руб., если это возможно.
#версия Python: 3.9.0
"""
num = int(input("Денежная сумма:"))
if (num % 2 == 1):
    print("Сумму нельзя разменять без остатка")
else:
    A = num % 500
    A1 = num // 500
    B = A % 100
    B1 = A // 100
    C = B % 10
    C1 = B // 10
    D = C % 2
    D1 = C // 2
    print(A1, "Купюр по 500 рублей")
    print(B1, "Купюр по 100 рублей")
    print(C1, "Купюр по 10 рублей")
    print(D1, "Монет по 2 рубля")
