"""
Имя проекта: practicum_1
Номер версии: 1.0
Имя файла: 20.py
Автор: 2020 © Ю.А. Мазкова, Челябинск
Лицензия использования:  CC BY-NC 4.0 (https://creativecommons.org/licenses/by-nc/4.0/deed.ru)
Дата создания: 10/12/2020
Дата последней модификации: 10/12/2020
Связанные файлы/пакеты: numpy, random
Описание: Решение задач № 1-101 практикума № 1
Дано число X. Определить, принадлежит ли это число заданному промежутку [a,b].
#версия Python: 3.9.0
"""
import math
x = int(input("Введите число для проверки:"))
a = int(input("Укажите начало промежутка:"))
b = int(input("Укажите конец промежутка:"))

if math.fabs(a) <= math.fabs(x) <= math.fabs(b):
    print("Число ",x, " Принадлежит промежутку [",a,",",b,"]")
else:
    print("Число ",x, " не принадлежит промежутку [",a,",",b,"]")
