"""
Имя проекта: practicum_1
Номер версии: 1.0
Имя файла: 21.py
Автор: 2020 © Ю.А. Мазкова, Челябинск
Лицензия использования:  CC BY-NC 4.0 (https://creativecommons.org/licenses/by-nc/4.0/deed.ru)
Дата создания: 10/12/2020
Дата последней модификации: 10/12/2020
Связанные файлы/пакеты: numpy, random
Описание: Решение задач № 1-101 практикума № 1
Определить значение функции Z = 1/(XY) при произвольных X и Y .
#версия Python: 3.9.0
"""
x = int(input("Введите Х:"))
y = int(input("Введите У:"))
z = 1 / (x*y)
print("Значение функции равно",z)
