"""
Имя проекта: practicum_1
Номер версии: 1.0
Имя файла: 36.py
Автор: 2020 © Ю.А. Мазкова, Челябинск
Лицензия использования:  CC BY-NC 4.0 (https://creativecommons.org/licenses/by-nc/4.0/deed.ru)
Дата создания: 10/12/2020
Дата последней модификации: 10/12/2020
Связанные файлы/пакеты: numpy, random
Описание: Решение задач № 1-101 практикума № 1
Дан одномерный массив числовых значений, насчитывающий N элементов. Вставить группу из M новых элементов, начиная с позиции K.
#версия Python: 3.9.0
"""
import array
import random
N = int(input("Введите количество элементов массива:"))
M = int(input("Количесвто элементов в группе:"))
K = int(input("Позиция K:"))
A = [random.randint(0, 100) for i in range(0, N)]
B = [random.randint(0, 100) for b in range(0, M)]
print(A)
print(B)
A.insert(K, B)
print(A)
