"""
Имя проекта: practicum_1
Номер версии: 1.0
Имя файла: 43.py
Автор: 2020 © Ю.А. Мазкова, Челябинск
Лицензия использования:  CC BY-NC 4.0 (https://creativecommons.org/licenses/by-nc/4.0/deed.ru)
Дата создания: 10/12/2020
Дата последней модификации: 10/12/2020
Связанные файлы/пакеты: numpy, random
Описание: Решение задач № 1-101 практикума № 1
Дан одномерный массив числовых значений, насчитывающий N элементов. Из элементов исходного массива построить два новых. В первый должны входить только элементы с положительными значениями, а во второй — только элементы с отрицательными значениямию
#версия Python: 3.9.0
"""
import random
N = random.randint(1,15)
arr = [random.randint(-90,90) for i in range(N)]
print(arr)
arrP = []
arrN = []
for i in range(N):
    if arr[i] < 0:
        arrN.append(arr[i])
    if arr[i] > 0:
        arrP.append(arr[i])
    print (arrN)
    print (arrP)
