"""
Имя проекта: practicum_1
Номер версии: 1.0
Имя файла: 45.py
Автор: 2020 © Ю.А. Мазкова, Челябинск
Лицензия использования:  CC BY-NC 4.0 (https://creativecommons.org/licenses/by-nc/4.0/deed.ru)
Дата создания: 10/12/2020
Дата последней модификации: 10/12/2020
Связанные файлы/пакеты: numpy, random
Описание: Решение задач № 1-101 практикума № 1
Дан одномерный массив числовых значений, насчитывающий N элементов.Добавить к элементам массива такой новый элемент, чтобы сумма элементов с положительнымизначениями стала бы равна модулю суммы элементов с отрицательными значениями.
#версия Python: 3.9.0
"""
import random
N = int(input("Введите количество элементов массива: "))
A = [random.randint(-100, 100) for i in range(N)]
print(A)
n = []
p = []
for i in range(N):
    if A[i] > 0:
        p.append(A[i])
    else:
        n.append(A[i])
sumn=abs(sum(n))
sump=sum(p)
Q=(sumn-sump)
print("Сумма элементов с положительными значениями: ", sumn)
print("Сумма элементов с отрицательными значениями: ", sump)
print("Разница:", Q)
if sumn == sump:
    print("Сумма отрицательных и положительных элементов массива равна")
if sumn > sump:
    A.append([Q])
if sump > sumn:
    A.append([Q])
print(A)
