"""
Имя проекта: practicum_1
Номер версии: 1.0
Имя файла: 52.py
Автор: 2020 © Ю.А. Мазкова, Челябинск
Лицензия использования:  CC BY-NC 4.0 (https://creativecommons.org/licenses/by-nc/4.0/deed.ru)
Дата создания: 10/12/2020
Дата последней модификации: 10/12/2020
Связанные файлы/пакеты: numpy, random
Описание: Решение задач № 1-101 практикума № 1
Заданы M строк символов, которые вводятся с клавиатуры.Из заданных строк, каждая из которых представляет одно слово,составить одну длинную строку, разделяя слова пробелами.
#версия Python: 3.9.0
"""
M = int(input("Введите количество строк: "))
x = []
for i in range(0, M):
    print("Введите строку:",  end=' ')
    x.append(input())
print(' '.join(x))
