"""
Имя проекта: practicum_1
Номер версии: 1.0
Имя файла: 8.py
Автор: 2020 © Ю.А. Мазкова, Челябинск
Лицензия использования:  CC BY-NC 4.0 (https://creativecommons.org/licenses/by-nc/4.0/deed.ru)
Дата создания: 20/11/2020
Дата последней модификации: 20/11/2020
Связанные файлы/пакеты: numpy, random
Описание: Решение задачи № 1-101 практикума № 1
Дано натуральное число. Определить, будет ли это число: нечётным, кратным 5.
#версия Python: 3.9.0
"""
a = int(input("Введите число для проверки:"))
if a % 2 == 1 and a % 5 == 0:
    print("Число", a, "нечетно и кратно 5")
else:
    print("Число не удовлетворяет условиям")
