"""
Имя проекта: practicum_1
Номер версии: 1.0
Имя файла: Task 7.py
Автор: 2020 © Ю.А. Мазкова, Челябинск
Лицензия использования:  CC BY-NC 4.0 (https://creativecommons.org/licenses/by-nc/4.0/deed.ru)
Дата создания: 20/11/2020
Дата последней модификации: 20/11/2020
Связанные файлы/пакеты: numpy, random
Описание: Решение задачи № 1-101 практикума № 1
Дано натуральное число. Определить, будет ли это число: чётным, кратным 4.
#версия Python: 3.9.0
"""
import random
A= random.randint (1,100)
print("Число:" + str(A))
if A % 2 == 0:
    print ("Число четное")
if A % 4 == 0:
    print ("Число кратно 4")
